<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core" %>
<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>홈화면</title>
    <c:import url="/cmn"></c:import>
    <link href="resources/css/kin/home.css" rel="stylesheet" type="text/css" />
<script type="text/javascript" src="resources/script/jquery/jquery.maphilight.min.js"></script>
<script type="text/javascript">
$(document).ready(function() {
	
	$("area").on("click", function() {
		   $("#locForm").attr("action", "disMap");
		   $("#dis").val($(this).attr("loc"))
		   $("#locForm").submit();	 
	   });
	
	$(".loc").on("click", function() {
		   $("#locForm").attr("action", "disMap");
		   $("#dis").val($(this).attr("loc"))
		   $("#locForm").submit();	 
	   });
	
});

$(function() {
	$.fn.maphilight.defaults = {
			fill: true,
			fillColor: 'f1f1f1',
			fillOpacity: 0.3,
			fade: true,
			alwaysOn: false,
			neverOn: false,
			groupBy: false,
			wrapClass: true,
		};
	$('.map').maphilight();
});
</script>
</head>
<body>
<c:import url="/header"></c:import>
<div class="map_wrap">
	<form action="#" id="locForm" method="post">
		<input type="hidden" name="dis" id="dis">
	</form>
	<img src="resources/images/kin/seoul_map_g.png" usemap="#image-map" class="map">
	<map name="image-map" class="image_map">
	<div class="info">지역으로 유치원 알아보기 </div>
        <div class="loc" loc="서울 도봉구 마들로 656" style="top:175px; left:609px;">도봉구</div>
        <div class="loc" loc="서울 강북구 도봉로89길 13" style="top:268px; left:570px;">강북구</div>
        <div class="loc" loc="서울 노원구 노해로 437" style="top:248px; left:708px;">노원구</div>
        <div class="loc" loc="서울 서대문구 연희로 248" style="top:454px; left:381px;">서대문구</div>
        <div class="loc" loc="서울 은평구 은평로 195" style="top:330px; left:368px;">은평구</div>
        <div class="loc" loc="서울 종로구 종로1길 36 대림빌딩" style="top:439px; left:483px;">종로구</div>
        <div class="loc" loc="서울 성북구 보문로 168" style="top:387px; left:574px;">성북구</div>
        <div class="loc" loc="서울 동대문구 천호대로 145" style="top:446px; left:647px;">동대문구</div>
        <div class="loc" loc="서울 중랑구 봉화산로 179" style="top:406px; left:743px;">중랑구</div>
        <div class="loc" loc="서울 마포구 월드컵로 212" style="top:514px; left:323px;">마포구</div>
        <div class="loc" loc="서울 용산구 녹사평대로 150" style="top:593px; left:481px;">용산구</div>
        <div class="loc" loc="서울 중구 창경궁로 17" style="top:512px; left:522px;">중구</div>
        <div class="loc" loc="서울 성동구 고산자로 270" style="top:544px; left:626px;">성동구</div>
        <div class="loc" loc="서울 광진구 자양로 117" style="top:556px; left:728px;">광진구</div>
        <div class="loc" loc="서울 강서구 화곡로 302" style="top:500px; left:115px;">강서구</div>
        <div class="loc" loc="서울 양천구 목동동로 105" style="top:627px; left:191px;">양천구</div>
        <div class="loc" loc="서울 영등포구 당산로 123" style="top:650px; left:304px;">영등포구</div>
        <div class="loc" loc="서울 동작구 장승배기로 161" style="top:687px; left:405px;">동작구</div>
        <div class="loc" loc="서울 서초구 남부순환로 2584" style="top:776px; left:556px;">서초구</div>
        <div class="loc" loc="서울 강남구 학동로 426" style="top:731px; left:662px;">강남구</div>
        <div class="loc" loc="서울 송파구 올림픽로 326" style="top:691px; left:786px;">송파구</div>
        <div class="loc" loc="서울 강동구 성내로 25" style="top:550px; left:866px;">강동구</div>
        <div class="loc" loc="서울 구로구 가마산로 245" style="top:710px; left:164px;">구로구</div>
        <div class="loc" loc="서울 금천구 시흥대로73길 70" style="top:800px; left:289px;">금천구</div>
        <div class="loc" loc="서울 관악구 관악로 145" style="top:800px; left:400px;">관악구</div>
	 	<area target="" alt="강동구" title="강동구" href="#" loc="서울 강동구 성내로 25" coords="946,481,925,490,902,506,892,510,866,509,840,526,828,535,822,552,818,575,822,582,831,583,836,592,832,607,826,620,838,629,845,646,863,649,870,655,878,656,897,624,897,608,899,599,908,597,960,579,967,568,963,559,964,549,956,537,964,517,961,503,950,499,946,485,946,482" shape="poly">
	    <area target="" alt="송파구" title="송파구" href="#" loc="서울 송파구 올림픽로 326" coords="711,650,746,650,770,642,798,608,807,598,814,577,822,584,829,584,832,592,831,601,824,618,835,629,840,642,846,649,860,651,867,657,877,658,871,668,863,685,869,691,869,703,911,720,913,729,901,734,895,740,895,762,885,774,876,775,871,786,866,803,854,804,845,807,842,816,838,826,825,800,815,789,811,762,796,751,787,747,786,736,777,729,759,726,748,724,737,717,720,706,711,694,708,668" shape="poly">
	    <area target="" alt="강남구" title="강남구" href="#" loc="서울 강남구 학동로 426" coords="578,630,592,619,629,617,648,623,671,636,688,643,706,648,705,668,705,685,709,697,720,712,744,727,758,731,776,734,782,741,783,749,806,765,811,792,818,799,834,827,820,828,813,838,807,846,793,846,786,852,775,851,765,839,752,831,748,818,746,804,737,796,724,796,707,801,700,811,694,818,683,820,668,824,659,815,656,799,652,785,651,772,644,768,638,762,626,756,616,745,610,735,609,714,607,700,599,692,595,679,592,664,590,653" shape="poly">
	    <area target="" alt="광진구" title="광진구" href="#" loc="서울 광진구 자양로 117" coords="790,487,776,487,763,493,737,496,729,511,722,528,720,547,714,566,708,577,700,590,697,601,692,622,717,629,744,629,759,626,770,609,783,595,797,570,800,557,800,547,803,536,786,536,784,519,779,510,791,493" shape="poly">
	    <area target="" alt="성동구" title="성동구" href="#" loc="서울 성동구 고산자로 270" coords="635,494,662,496,668,510,718,528,715,549,710,569,704,576,696,588,693,605,687,619,655,603,638,597,621,596,588,598,579,566,585,552,590,542,604,531,612,517,612,508,612,496,621,500,627,501" shape="poly">
		<area target="" alt="강서구" title="강서구" href="#" loc="서울 강서구 화곡로 302" coords="98,380,90,389,92,401,98,410,94,427,77,443,75,475,49,488,41,519,28,530,35,550,74,568,84,588,102,572,138,573,145,562,160,561,171,568,184,601,207,610,229,604,238,588,240,566,249,554,258,555,272,556,273,543,235,513,231,497,216,481,180,463,170,445,154,430,138,406" shape="poly">
	    <area target="" alt="양천구" title="양천구" href="#" loc="서울 양천구 목동동로 105" coords="146,574,149,565,163,565,169,572,183,606,213,614,231,607,241,588,244,567,252,558,262,559,274,561,284,582,291,596,290,608,273,622,271,663,264,682,236,686,225,667,209,666,186,684,167,687,163,672,143,672,152,652,152,595" shape="poly">
	    <area target="" alt="구로구" title="구로구" href="#" loc="서울 구로구 가마산로 245" coords="147,676,151,682,129,727,143,755,128,791,141,793,155,787,163,790,182,793,219,756,220,743,227,736,237,730,254,739,257,755,294,757,306,749,306,719,300,712,295,681,275,668,265,687,236,687,225,670,209,668,188,686,163,687,160,677" shape="poly">
	    <area target="" alt="금천구" title="금천구" href="#" loc="서울 금천구 시흥대로73길 70" coords="260,759,291,760,306,751,322,760,330,759,334,768,342,772,351,846,357,854,366,857,370,871,359,877,351,895,337,904,312,904,289,819,278,819" shape="poly">
	    <area target="" alt="관악구" title="관악구" href="#" loc="서울 관악구 관악로 145" coords="334,760,346,772,354,845,368,856,373,870,371,876,386,880,392,896,400,904,445,902,477,885,521,837,529,835,509,796,508,784,502,789,485,790,464,774,455,740,435,733,380,731,375,742,358,747,349,748" shape="poly">
	    <area target="" alt="영등포구" title="영등포구" href="#" loc="서울 영등포구 당산로 123" coords="277,545,293,590,295,603,277,622,276,664,297,676,303,710,310,720,309,748,329,758,332,742,339,730,363,723,372,687,388,651,368,629,361,594,300,570" shape="poly">
	    <area target="" alt="동작구" title="동작구" href="#" loc="서울 동작구 장승배기로 161" coords="394,653,374,690,373,709,366,723,343,731,332,755,352,745,371,739,377,730,429,726,459,738,466,769,484,786,501,785,509,782,515,720,507,704,492,701,487,686,464,681,438,654" shape="poly">
	    <area target="" alt="서초구" title="서초구" href="#" loc="서울 서초구 남부순환로 2584" coords="494,690,525,686,577,636,589,658,594,692,604,702,609,739,622,758,639,766,650,781,664,826,699,821,709,807,733,800,745,807,745,828,751,834,771,851,759,859,756,869,753,879,743,881,736,892,702,905,699,929,665,928,635,909,629,869,628,831,605,823,583,836,570,851,558,849,553,831,543,828,535,834,514,799,516,720,509,700,494,700" shape="poly">
	    <area target="" alt="마포구" title="마포구" href="#" loc="서울 마포구 월드컵로 212" coords="288,416,279,422,279,432,265,447,242,447,228,460,249,484,254,500,308,548,379,579,395,587,412,601,424,609,451,583,462,570,469,547,459,522,452,528,402,522,311,440,301,428,292,425" shape="poly">
	    <area target="" alt="은평구" title="은평구" href="#" loc="서울 은평구 은평로 195" coords="295,420,306,427,339,457,341,445,357,430,390,429,398,413,420,403,426,385,439,379,448,378,450,339,451,321,472,292,479,279,475,249,434,215,420,236,397,234,388,245,356,244,351,320,343,328,342,397,323,422" shape="poly">
	    <area target="" alt="서대문구" title="서대문구" href="#" loc="서울 서대문구 연희로 248" coords="447,380,435,385,428,392,423,407,403,415,394,428,359,435,345,446,345,460,406,518,451,525,477,504,461,486,454,472,467,429,461,407,449,396" shape="poly">
	    <area target="" alt="용산구" title="용산구" href="#" loc="서울 용산구 녹사평대로 150" coords="459,580,429,614,473,660,515,666,583,602,578,569,563,560,541,560,526,548,485,549,473,550" shape="poly">	
		<area target="" alt="도봉구" title="도봉구" href="#" loc="서울 도봉구 마들로 656" coords="590,97,610,88,623,88,632,89,634,99,639,109,652,109,667,109,676,115,687,118,688,133,681,148,676,169,675,181,680,193,686,208,684,229,683,249,679,269,676,286,676,297,662,296,617,244,604,241,580,218,584,199,581,179,585,162,580,133,587,127" shape="poly">
	    <area target="" alt="노원구" title="노원구" href="#" loc="서울 노원구 노해로 437" coords="724,92,735,92,751,105,760,112,765,116,780,117,783,123,782,131,773,142,770,149,777,163,785,170,786,183,786,192,775,197,774,205,773,217,771,224,771,239,777,249,782,254,793,253,806,259,811,268,814,283,817,294,815,302,810,309,801,312,797,323,799,333,785,338,770,339,757,340,747,345,734,349,724,355,710,352,697,347,676,317,665,300,679,297,681,281,688,265,688,250,691,213,687,195,681,182,681,167,683,155,688,144,691,135,692,124,693,115,704,109,713,103,719,98" shape="poly">
	    <area target="" alt="강북구" title="강북구" href="#" loc="서울 강북구 도봉로89길 13" coords="577,134,579,149,583,159,578,173,579,185,579,198,577,209,578,219,590,234,596,240,605,244,615,245,624,257,639,273,653,291,665,310,672,319,667,329,661,342,655,353,646,360,624,360,603,361,593,357,585,324,559,302,548,293,530,287,522,275,527,270,525,205,547,171,551,143" shape="poly">
	    <area target="" alt="성북구" title="성북구" href="#" loc="서울 성북구 보문로 168" coords="521,281,527,292,542,296,556,306,568,317,580,326,585,339,587,352,589,361,599,366,616,365,632,366,644,366,652,360,661,350,667,338,673,329,675,322,683,336,691,346,699,354,711,356,721,360,721,372,721,382,701,389,683,393,671,396,659,412,652,426,642,430,627,439,621,446,617,460,609,470,583,466,557,422,516,408,515,394,527,392,531,384,532,372,527,352,521,333,515,319,512,304,510,298,503,292,511,292,516,288" shape="poly">
	    <area target="" alt="종로구" title="종로구" href="#" loc="서울 종로구 종로1길 36 대림빌딩" coords="472,297,495,293,507,301,513,321,519,345,528,374,524,386,513,389,510,407,517,415,535,418,554,425,579,469,607,473,607,490,532,494,519,485,479,501,457,472,471,428,463,401,451,395,455,321,467,309" shape="poly">
	    <area target="" alt="동대문구" title="동대문구" href="#" loc="서울 동대문구 천호대로 145" coords="721,386,733,492,720,524,671,508,664,492,637,488,629,496,618,497,613,489,613,472,620,463,624,448,656,432,660,416,669,405,679,396,694,394,707,390" shape="poly">
	    <area target="" alt="중랑구" title="중랑구" href="#" loc="서울 중랑구 봉화산로 179" coords="725,359,739,353,749,348,758,343,774,343,786,343,800,339,805,343,819,345,821,354,827,363,827,372,825,379,815,387,815,397,818,405,817,414,815,421,813,431,812,439,806,446,799,451,797,458,791,465,787,471,789,481,781,481,771,485,761,490,749,491,737,490" shape="poly">
	    <area target="" alt="중구" title="중구" href="#" loc="서울 중구 창경궁로 17" coords="481,504,496,500,507,495,514,490,522,491,532,498,546,499,567,496,585,495,607,495,608,505,606,514,601,525,593,532,589,539,581,552,577,563,568,559,560,553,547,555,540,555,530,546,522,542,506,543,489,545,479,545,472,545,464,520,473,513" shape="poly">
	</map>
</div>
<div class="bottom"></div>
</body>
</html>